In [4]:
from cassandra.cluster import Cluster
if __name__ == "__main__":
    cluster = Cluster(['172.19.0.2'],port=9042)
    session = cluster.connect('cityinfo',wait_for_all_pools=True)
    session.execute('USE cityinfo')
    rows = session.execute('SELECT * FROM users')
    for row in rows:
        print(row.age,row.name,row.username)

34 Raul Samayoa rs34
34 Penny Loafer pl34
23 Jack Ryan jr23

## read from cassandra

In [10]:
import pandas as pd
session = cluster.connect('cityinfo',wait_for_all_pools=True)
session.execute('USE cityinfo')
data = pd.DataFrame(list(session.execute('SELECT * FROM cities')))
data

   id  country      name
0   5      USA   Buffalo
1   1   Canada   Toronto
2   2   Canada    Ottawa
3   4  Germany    Berlin
4   3   Canada  Edmonton

In [35]:
data2 =[[6,'USA','LA'],[7,'Mexico','Cancun'],[8,'Chile','Santiago']]
new_cities = pd.DataFrame(data2,columns=['id','country','name'])
new_cities

   id country      name
0   6     USA        LA
1   7  Mexico    Cancun
2   8   Chile  Santiago

## write to cassandra

In [51]:
from cassandra import ConsistencyLevel
from cassandra.query import BatchStatement
session = cluster.connect('cityinfo',wait_for_all_pools=True)
session.execute('USE cityinfo')
prepared_query = session.prepare('INSERT INTO cities(id, country, name) VALUES (?,?,?)')
for index, item in new_cities.iterrows():
    session.execute(prepared_query, (item[0],item[1],item[2]))

In [49]:
for index, item in new_cities.iterrows():
    print(item.id,item[1],item[2])

6 USA LA
7 Mexico Cancun
8 Chile Santiago

In [52]:
data2 = pd.DataFrame(list(session.execute('SELECT * FROM cities')))
data2

   id  country      name
0   5      USA   Buffalo
1   1   Canada   Toronto
2   8    Chile  Santiago
3   2   Canada    Ottawa
4   4  Germany    Berlin
5   7   Mexico    Cancun
6   6      USA        LA
7   3   Canada  Edmonton